src/main/scala/io/cotiviti/fs2/script.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-26 Mon 09:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Carlson" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1ad5eb7">1. Script</a>
<ul>
<li><a href="#orgf76fb26">1.1. Stream</a></li>
<li><a href="#org775d8dd">1.2. FS2</a></li>
<li><a href="#org28e2147">1.3. Effect Types</a>
<ul>
<li><a href="#org8aca88a">1.3.1. map/flatMap</a></li>
<li><a href="#org140489d">1.3.2. write to file</a></li>
</ul>
</li>
<li><a href="#org345a4d5">1.4. Error handling</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1ad5eb7" class="outline-2">
<h2 id="org1ad5eb7"><span class="section-number-2">1</span> Script</h2>
<div class="outline-text-2" id="text-1">
<hr />
</div>
<div id="outline-container-orgf76fb26" class="outline-3">
<h3 id="orgf76fb26"><span class="section-number-3">1.1</span> Stream</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b294bb; font-weight: bold;">val</span> <span style="color: #cc6666;">s</span> <span style="color: #b294bb; font-weight: bold;">=</span> <span style="color: #de935f;">Stream</span>(<span style="color: #de935f;">1</span>,<span style="color: #de935f;">2</span>,<span style="color: #de935f;">3</span>)

println(s.toVector)
pritnln(s)
</pre>
</div>

<hr />
</div>
</div>
<div id="outline-container-org775d8dd" class="outline-3">
<h3 id="org775d8dd"><span class="section-number-3">1.2</span> FS2</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b294bb; font-weight: bold;">import</span> fs2.<span style="color: #b294bb; font-weight: bold;">_</span>
</pre>
</div>
<ul class="org-ul">
<li>Show how the value itself does not change</li>
<li>Show repeat to indicate that it can be non-terminating</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org28e2147" class="outline-3">
<h3 id="org28e2147"><span class="section-number-3">1.3</span> Effect Types</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Show type signature
Effects
</p>
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b294bb; font-weight: bold;">import</span> scala.util.<span style="color: #de935f;">Random</span>
<span style="color: #b294bb; font-weight: bold;">import</span> java.nio.file.<span style="color: #de935f;">Paths</span>

<span style="color: #de935f;">Stream</span>.eval(<span style="color: #de935f;">IO</span> { println(<span style="color: #b5bd68;">"Random"</span>) ; <span style="color: #de935f;">Random</span>.nextInt(<span style="color: #de935f;">100</span>) }
  .repeat
  .take(<span style="color: #de935f;">100</span>)
</pre>
</div>
</div>
<div id="outline-container-org8aca88a" class="outline-4">
<h4 id="org8aca88a"><span class="section-number-4">1.3.1</span> map/flatMap</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-scala">.map(c <span style="color: #b294bb; font-weight: bold;">=&gt;</span> ((<span style="color: #de935f;">9</span> * c) / <span style="color: #de935f;">5</span>) + <span style="color: #de935f;">32</span>)
.map(<span style="color: #b294bb; font-weight: bold;">_</span>.toString)
</pre>
</div>
</div>
</div>
<div id="outline-container-org140489d" class="outline-4">
<h4 id="org140489d"><span class="section-number-4">1.3.2</span> write to file</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
<ol class="org-ol">
<li><a id="org357084e"></a>Sink<br />
<div class="outline-text-5" id="text-1-3-2-1">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b294bb; font-weight: bold;">def</span> <span style="color: #81a2be; font-weight: bold;">log</span>(header<span style="color: #b294bb; font-weight: bold;">:</span> <span style="color: #f0c674;">String</span>)<span style="color: #b294bb; font-weight: bold;">:</span> <span style="color: #f0c674;">Sink</span>[<span style="color: #de935f;">IO</span>, <span style="color: #de935f;">String</span>] <span style="color: #b294bb; font-weight: bold;">=</span> <span style="color: #b294bb; font-weight: bold;">_</span>
  .map(i <span style="color: #b294bb; font-weight: bold;">=&gt;</span> s<span style="color: #b5bd68;">"</span><span style="color: #cc6666;">$header$i</span><span style="color: #b5bd68;">"</span>)
  .evalMap(s <span style="color: #b294bb; font-weight: bold;">=&gt;</span> <span style="color: #de935f;">IO</span> { println(s) })
<span style="color: #b294bb; font-weight: bold;">import</span> scala.concurrent.<span style="color: #de935f;">ExecutionContext</span>.<span style="color: #de935f;">Implicits</span>.global
.to(log(<span style="color: #b5bd68;">"f&gt; "</span>))
.observe(log(<span style="color: #b5bd68;">"&lt;c "</span>))
</pre>
</div>
</div>
</li>
<li><a id="org1336bc0"></a>Pipe<br />
<div class="outline-text-5" id="text-1-3-2-2">
<div class="org-src-container">
<pre class="src src-scala">.intersperse(<span style="color: #b5bd68;">"</span><span style="color: #de935f;">\n</span><span style="color: #b5bd68;">"</span>)
.through(text.utf8Encode)
.to(io.file.writeAll(<span style="color: #de935f;">Paths</span>.get(<span style="color: #b5bd68;">"/tmp/f"</span>))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org345a4d5" class="outline-3">
<h3 id="org345a4d5"><span class="section-number-3">1.4</span> Error handling</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-scala">.evalMap(i <span style="color: #b294bb; font-weight: bold;">=&gt;</span> <span style="color: #b294bb; font-weight: bold;">if</span> (i % <span style="color: #de935f;">13</span> == <span style="color: #de935f;">0</span>) {
  <span style="color: #de935f;">IO</span>.raiseError(<span style="color: #b294bb; font-weight: bold;">new</span> <span style="color: #f0c674;">RuntimeException</span>(<span style="color: #b5bd68;">"13s! Oh no!"</span>)
} <span style="color: #b294bb; font-weight: bold;">else</span> <span style="color: #de935f;">IO</span>.pure(i)
</pre>
</div>

<ul class="org-ul">
<li>Open file and show it</li>
</ul>
<hr />
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #de935f;">Stream</span>.bracket(i <span style="color: #b294bb; font-weight: bold;">=&gt;</span> <span style="color: #de935f;">IO</span> {
  println(<span style="color: #b5bd68;">"Open"</span>)
})(
  use <span style="color: #b294bb; font-weight: bold;">=</span> s,
  release <span style="color: #b294bb; font-weight: bold;">=</span> <span style="color: #b294bb; font-weight: bold;">_</span> <span style="color: #b294bb; font-weight: bold;">=&gt;</span> <span style="color: #de935f;">IO</span> { println(<span style="color: #b5bd68;">"Closing"</span>) }
)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Carlson</p>
<p class="date">Created: 2018-02-26 Mon 09:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
